'use client';
import CardOrder from '@/components/profile/CardOrder';
import FilterOrders from '@/components/profile/FilterOrders';
import React, { Suspense } from 'react';
import Pagination from '@/components/common/Pagination';
import BackPrevPage from '@/components/common/BackPrevPage';
import { useGetOrders } from '@/hooks/profile/useGetOrders';
import { useSearchParams } from 'next/navigation';
import { Spinner } from '@heroui/react';
import { Order, STATUSCOUNTS } from '@/types/profile';
import EmptyOrder from '@/components/profile/EmptyOrder';
import FilterCourse from '@/components/profile/FilterCourse';
import { useGetCourse } from '@/hooks/profile/useGetCourse';
import Image from '@/components/common/Image';
import { Toman_Icon } from '@/components/common/icon';
import Link from 'next/link';

const Page = () => {
  const searchParams = useSearchParams();
  const { data, isPending } = useGetCourse({
    page: searchParams.get('page')!,
  });
  const orders: { order: Order[]; totalPages: number; totalItems: number } = data?.data?.data;
  const orderStatusCounts: STATUSCOUNTS = data?.data?.data?.statusCounts;
  const sortOrders = orders?.order?.filter(
    (item) => item.courseItems.status === (searchParams.get('sort') || 'AWAITING')
  );
  return (
    <div className="space-y-4 rounded-2xl border-[#E4E7E9] bg-white pt-4 dark:border-[#505B74] dark:bg-[#263248] lg:mb-10 lg:min-h-[90vh] lg:!w-full lg:border lg:p-[16px] lg:pt-0">
      <BackPrevPage url="/profile" title="تاریخچه سفارش‌ها" />
      {/* <div className='container_page lg:!w-full lg:flex-row  flex  flex-col items-center gap-6 lg:justify-between'>
                <p className='text-[#0C0C0C] hidden lg:block font-medium text-[14px] lg:text-[18px]'>تاریخچه سفارش‌های من</p>
                <Input className='lg:!w-[284px]' placeholder='جستجو ' classNameInput='!h-[48px] bg-[#F5F6F6]' startContent={<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M11.5 21C16.7467 21 21 16.7467 21 11.5C21 6.25329 16.7467 2 11.5 2C6.25329 2 2 6.25329 2 11.5C2 16.7467 6.25329 21 11.5 21Z" stroke="#616A76" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                    <path d="M22 22L20 20" stroke="#616A76" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
                </svg>
                }
                />
            </div> */}

      <div className="">
        <div className="flex items-center gap-3">
          <span>
            <svg
              width="29"
              height="22"
              viewBox="0 0 29 22"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M27.6519 7.58742L26.3185 6.85409L14.3185 0.187422H14.1719C14.0901 0.15286 14.0053 0.126075 13.9185 0.107422H13.6652H13.4252C13.3341 0.126088 13.2449 0.152861 13.1585 0.187422H13.0119L1.01187 6.85409C0.806671 6.97038 0.635994 7.13902 0.517248 7.34281C0.398502 7.54659 0.335937 7.77823 0.335938 8.01409C0.335937 8.24995 0.398502 8.48159 0.517248 8.68537C0.635994 8.88916 0.806671 9.0578 1.01187 9.17409L4.33187 11.0141V17.3341C4.33187 18.395 4.7533 19.4124 5.50344 20.1625C6.25359 20.9127 7.271 21.3341 8.33187 21.3341H18.9985C20.0594 21.3341 21.0768 20.9127 21.827 20.1625C22.5771 19.4124 22.9985 18.395 22.9985 17.3341V11.0141L25.6652 9.52076V13.3341C25.6652 13.6877 25.8057 14.0268 26.0557 14.2769C26.3058 14.5269 26.6449 14.6674 26.9985 14.6674C27.3522 14.6674 27.6913 14.5269 27.9413 14.2769C28.1914 14.0268 28.3319 13.6877 28.3319 13.3341V8.74742C28.3315 8.51116 28.2683 8.27925 28.1488 8.07543C28.0293 7.8716 27.8578 7.70319 27.6519 7.58742V7.58742ZM20.3319 17.3341C20.3319 17.6877 20.1914 18.0269 19.9413 18.2769C19.6913 18.5269 19.3522 18.6674 18.9985 18.6674H8.33187C7.97825 18.6674 7.63911 18.5269 7.38906 18.2769C7.13901 18.0269 6.99854 17.6877 6.99854 17.3341V12.4941L13.0119 15.8274L13.2119 15.9074H13.3319C13.4425 15.9214 13.5545 15.9214 13.6652 15.9074C13.7759 15.9214 13.8879 15.9214 13.9985 15.9074H14.1185C14.1893 15.8925 14.257 15.8654 14.3185 15.8274L20.3319 12.4941V17.3341ZM13.6652 13.1474L4.41187 8.00076L13.6652 2.85409L22.9185 8.00076L13.6652 13.1474Z"
                fill="#6E3DFF"
              />
            </svg>
          </span>
          <p className="container_page !my-6 hidden font-medium text-[14px] text-[#0C0C0C] dark:text-white lg:block lg:!w-full lg:text-[18px]">
            دوره های من
          </p>
        </div>
        <Suspense>
          <FilterCourse orderStatusCounts={orderStatusCounts} />
        </Suspense>
        {isPending ? (
          <Spinner
            classNames={{ circle1: 'border-b-main', circle2: 'border-b-main' }}
            size="lg"
            className="!mt-20 flex items-center justify-center"
          />
        ) : sortOrders?.length >= 1 ? (
          <div className="container_page mt-5 flex flex-col gap-5 lg:!w-full">
            {sortOrders.map((order, idx) => (
              <div key={idx} className="flex items-center gap-4 border-b border-gray-200 pb-4">
                <div className="flex flex-1 gap-4">
                  <div>
                    <Image
                      className="h-[130px] w-[130px] overflow-hidden rounded-lg"
                      alt=""
                      src={order.courseItems.thumbnailImage.url}
                    />
                  </div>
                  <div className="flex-1 space-y-6 border-l border-[#EDEDED]">
                    <p className="font-medium text-[16px] text-[#0B1524]">
                      {order.courseItems.title}
                    </p>{' '}
                    <div className="flex items-center gap-1">
                      <span>
                        <svg
                          width="20"
                          height="21"
                          viewBox="0 0 20 21"
                          fill="none"
                          xmlns="http://www.w3.org/2000/svg"
                        >
                          <mask id="path-1-inside-1_85_22565" fill="white">
                            <path d="M15.8307 3H4.16406C3.50102 3 2.86514 3.26339 2.3963 3.73223C1.92745 4.20107 1.66406 4.83696 1.66406 5.5V12.1667C1.66406 12.8297 1.92745 13.4656 2.3963 13.9344C2.86514 14.4033 3.50102 14.6667 4.16406 14.6667H9.16406V16.3333H5.83073C5.60972 16.3333 5.39775 16.4211 5.24147 16.5774C5.08519 16.7337 4.9974 16.9457 4.9974 17.1667C4.9974 17.3877 5.08519 17.5996 5.24147 17.7559C5.39775 17.9122 5.60972 18 5.83073 18H14.1641C14.3851 18 14.597 17.9122 14.7533 17.7559C14.9096 17.5996 14.9974 17.3877 14.9974 17.1667C14.9974 16.9457 14.9096 16.7337 14.7533 16.5774C14.597 16.4211 14.3851 16.3333 14.1641 16.3333H10.8307V14.6667H15.8307C16.4938 14.6667 17.1297 14.4033 17.5985 13.9344C18.0673 13.4656 18.3307 12.8297 18.3307 12.1667V5.5C18.3307 4.83696 18.0673 4.20107 17.5985 3.73223C17.1297 3.26339 16.4938 3 15.8307 3ZM16.6641 12.1667C16.6641 12.3877 16.5763 12.5996 16.42 12.7559C16.2637 12.9122 16.0517 13 15.8307 13H4.16406C3.94305 13 3.73109 12.9122 3.57481 12.7559C3.41853 12.5996 3.33073 12.3877 3.33073 12.1667V5.5C3.33073 5.27899 3.41853 5.06702 3.57481 4.91074C3.73109 4.75446 3.94305 4.66667 4.16406 4.66667H15.8307C16.0517 4.66667 16.2637 4.75446 16.42 4.91074C16.5763 5.06702 16.6641 5.27899 16.6641 5.5V12.1667Z" />
                          </mask>
                          <path
                            d="M4.16406 3L4.16406 0.6375L4.16406 3ZM1.66406 5.5H-0.698438H1.66406ZM1.66406 12.1667L-0.698438 12.1667L1.66406 12.1667ZM9.16406 14.6667H11.5266V12.3042H9.16406V14.6667ZM9.16406 16.3333V18.6958H11.5266V16.3333H9.16406ZM10.8307 16.3333H8.46823V18.6958H10.8307V16.3333ZM10.8307 14.6667V12.3042H8.46823V14.6667H10.8307ZM15.8307 14.6667L15.8307 17.0292L15.8307 14.6667ZM18.3307 12.1667H20.6932H18.3307ZM18.3307 5.5L20.6932 5.5L18.3307 5.5ZM4.16406 4.66667V7.02917V4.66667ZM15.8307 3V0.6375H4.16406V3V5.3625H15.8307V3ZM4.16406 3L4.16406 0.6375C2.87445 0.6375 1.63765 1.1498 0.725756 2.06169L2.3963 3.73223L4.06684 5.40277C4.09262 5.37699 4.1276 5.3625 4.16406 5.3625L4.16406 3ZM2.3963 3.73223L0.725756 2.06169C-0.18614 2.97359 -0.698438 4.21038 -0.698438 5.5L1.66406 5.5L4.02656 5.5C4.02656 5.46353 4.04105 5.42856 4.06684 5.40277L2.3963 3.73223ZM1.66406 5.5H-0.698438V12.1667H1.66406H4.02656V5.5H1.66406ZM1.66406 12.1667L-0.698438 12.1667C-0.698438 13.4563 -0.18614 14.6931 0.725756 15.605L2.3963 13.9344L4.06684 12.2639C4.04105 12.2381 4.02656 12.2031 4.02656 12.1667L1.66406 12.1667ZM2.3963 13.9344L0.725756 15.605C1.63765 16.5169 2.87445 17.0292 4.16406 17.0292V14.6667V12.3042C4.12759 12.3042 4.09262 12.2897 4.06684 12.2639L2.3963 13.9344ZM4.16406 14.6667V17.0292H9.16406V14.6667V12.3042H4.16406V14.6667ZM9.16406 14.6667H6.80156V16.3333H9.16406H11.5266V14.6667H9.16406ZM9.16406 16.3333V13.9708H5.83073V16.3333V18.6958H9.16406V16.3333ZM5.83073 16.3333V13.9708C4.98315 13.9708 4.17027 14.3075 3.57093 14.9069L5.24147 16.5774L6.91201 18.2479C6.62524 18.5347 6.23629 18.6958 5.83073 18.6958V16.3333ZM5.24147 16.5774L3.57093 14.9069C2.9716 15.5062 2.6349 16.3191 2.6349 17.1667H4.9974H7.3599C7.3599 17.5722 7.19879 17.9612 6.91201 18.2479L5.24147 16.5774ZM4.9974 17.1667H2.6349C2.6349 18.0143 2.9716 18.8271 3.57093 19.4265L5.24147 17.7559L6.91201 16.0854C7.19879 16.3722 7.3599 16.7611 7.3599 17.1667H4.9974ZM5.24147 17.7559L3.57093 19.4265C4.17027 20.0258 4.98315 20.3625 5.83073 20.3625V18V15.6375C6.23629 15.6375 6.62524 15.7986 6.91201 16.0854L5.24147 17.7559ZM5.83073 18V20.3625H14.1641V18V15.6375H5.83073V18ZM14.1641 18V20.3625C15.0116 20.3625 15.8245 20.0258 16.4239 19.4265L14.7533 17.7559L13.0828 16.0854C13.3696 15.7986 13.7585 15.6375 14.1641 15.6375V18ZM14.7533 17.7559L16.4239 19.4265C17.0232 18.8271 17.3599 18.0142 17.3599 17.1667H14.9974H12.6349C12.6349 16.7611 12.796 16.3722 13.0828 16.0854L14.7533 17.7559ZM14.9974 17.1667H17.3599C17.3599 16.3191 17.0232 15.5062 16.4239 14.9069L14.7533 16.5774L13.0828 18.2479C12.796 17.9612 12.6349 17.5722 12.6349 17.1667H14.9974ZM14.7533 16.5774L16.4239 14.9069C15.8245 14.3075 15.0116 13.9708 14.1641 13.9708V16.3333V18.6958C13.7585 18.6958 13.3696 18.5347 13.0828 18.2479L14.7533 16.5774ZM14.1641 16.3333V13.9708H10.8307V16.3333V18.6958H14.1641V16.3333ZM10.8307 16.3333H13.1932V14.6667H10.8307H8.46823V16.3333H10.8307ZM10.8307 14.6667V17.0292H15.8307V14.6667V12.3042H10.8307V14.6667ZM15.8307 14.6667L15.8307 17.0292C17.1203 17.0292 18.3571 16.5169 19.269 15.605L17.5985 13.9344L15.928 12.2639C15.9022 12.2897 15.8672 12.3042 15.8307 12.3042L15.8307 14.6667ZM17.5985 13.9344L19.269 15.605C20.1809 14.6931 20.6932 13.4563 20.6932 12.1667L18.3307 12.1667L15.9682 12.1667C15.9682 12.2031 15.9537 12.2381 15.928 12.2639L17.5985 13.9344ZM18.3307 12.1667H20.6932V5.5H18.3307H15.9682V12.1667H18.3307ZM18.3307 5.5L20.6932 5.5C20.6932 4.21039 20.1809 2.97359 19.269 2.06169L17.5985 3.73223L15.928 5.40277C15.9537 5.42856 15.9682 5.46353 15.9682 5.5L18.3307 5.5ZM17.5985 3.73223L19.269 2.06169C18.3571 1.1498 17.1203 0.6375 15.8307 0.6375L15.8307 3L15.8307 5.3625C15.8672 5.3625 15.9022 5.37699 15.928 5.40277L17.5985 3.73223ZM16.6641 12.1667H14.3016C14.3016 11.7611 14.4627 11.3722 14.7494 11.0854L16.42 12.7559L18.0905 14.4265C18.6899 13.8271 19.0266 13.0142 19.0266 12.1667H16.6641ZM16.42 12.7559L14.7494 11.0854C15.0362 10.7986 15.4252 10.6375 15.8307 10.6375V13V15.3625C16.6783 15.3625 17.4912 15.0258 18.0905 14.4265L16.42 12.7559ZM15.8307 13V10.6375H4.16406V13V15.3625H15.8307V13ZM4.16406 13V10.6375C4.56962 10.6375 4.95857 10.7986 5.24535 11.0854L3.57481 12.7559L1.90427 14.4265C2.5036 15.0258 3.31647 15.3625 4.16406 15.3625V13ZM3.57481 12.7559L5.24535 11.0854C5.53212 11.3722 5.69323 11.7611 5.69323 12.1667H3.33073H0.968229C0.968229 13.0143 1.30493 13.8271 1.90427 14.4265L3.57481 12.7559ZM3.33073 12.1667H5.69323V5.5H3.33073H0.968229V12.1667H3.33073ZM3.33073 5.5H5.69323C5.69323 5.90556 5.53212 6.29451 5.24535 6.58128L3.57481 4.91074L1.90427 3.2402C1.30493 3.83954 0.968229 4.65241 0.968229 5.5H3.33073ZM3.57481 4.91074L5.24535 6.58128C4.95857 6.86806 4.56962 7.02917 4.16406 7.02917L4.16406 4.66667L4.16406 2.30417C3.31647 2.30417 2.5036 2.64087 1.90427 3.2402L3.57481 4.91074ZM4.16406 4.66667V7.02917H15.8307V4.66667V2.30417H4.16406V4.66667ZM15.8307 4.66667V7.02917C15.4252 7.02917 15.0362 6.86806 14.7494 6.58128L16.42 4.91074L18.0905 3.2402C17.4912 2.64087 16.6783 2.30417 15.8307 2.30417V4.66667ZM16.42 4.91074L14.7494 6.58128C14.4627 6.29451 14.3016 5.90556 14.3016 5.5H16.6641H19.0266C19.0266 4.65242 18.6899 3.83954 18.0905 3.2402L16.42 4.91074ZM16.6641 5.5H14.3016V12.1667H16.6641H19.0266V5.5H16.6641Z"
                            fill="#6A7890"
                            mask="url(#path-1-inside-1_85_22565)"
                          />
                        </svg>
                      </span>
                      <span className="font-medium text-[#6A7890]">
                        {order.courseItems.type === 'online' ? 'آنلاین' : 'حضوری'}
                      </span>
                    </div>
                    <p className="flex items-center gap-1">
                      <span className="whitespace-nowrap font-bold text-[14px] text-[#0C0C0C] dark:text-white">
                        {order.courseItems?.discountPrice
                          ? order.courseItems?.discountPrice.toLocaleString()
                          : order.courseItems.price.toLocaleString()}
                      </span>
                      <Toman_Icon />
                    </p>
                  </div>
                </div>
                <div className="space-y-8">
                  <Link
                    className="flex h-[40px] w-[186px] items-center justify-center rounded-lg bg-main font-medium text-white"
                    href={`/course/video/${order.courseItems.courseId}`}
                  >
                    شروع یادگیری
                  </Link>
                  <Link
                    className="flex h-[40px] w-[186px] items-center justify-center rounded-lg border font-medium text-main"
                    href={`/couse/${order.courseItems.url}`}
                  >
                    ثبت نظر
                  </Link>
                </div>
              </div>
            ))}
          </div>
        ) : (
          <EmptyOrder />
        )}
      </div>
      {orders?.totalPages > 1 && <Pagination top={0} total={data?.data?.data?.totalPages} />}
    </div>
  );
};

export default Page;
