import { freeShippingPrice } from './variable';

export const statusIcon = [
  {
    status: 'done',
    name: 'ارسال شده',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M12 2C6.49 2 2 6.49 2 12C2 17.51 6.49 22 12 22C17.51 22 22 17.51 22 12C22 6.49 17.51 2 12 2ZM16.78 9.7L11.11 15.37C10.97 15.51 10.78 15.59 10.58 15.59C10.38 15.59 10.19 15.51 10.05 15.37L7.22 12.54C6.93 12.25 6.93 11.77 7.22 11.48C7.51 11.19 7.99 11.19 8.28 11.48L10.58 13.78L15.72 8.64C16.01 8.35 16.49 8.35 16.78 8.64C17.07 8.93 17.07 9.4 16.78 9.7Z"
          fill="#0ABF8C"
        />
      </svg>
    ),
  },
  {
    status: 'Posted',
    name: 'ارسال شده',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M12 2C6.49 2 2 6.49 2 12C2 17.51 6.49 22 12 22C17.51 22 22 17.51 22 12C22 6.49 17.51 2 12 2ZM16.78 9.7L11.11 15.37C10.97 15.51 10.78 15.59 10.58 15.59C10.38 15.59 10.19 15.51 10.05 15.37L7.22 12.54C6.93 12.25 6.93 11.77 7.22 11.48C7.51 11.19 7.99 11.19 8.28 11.48L10.58 13.78L15.72 8.64C16.01 8.35 16.49 8.35 16.78 8.64C17.07 8.93 17.07 9.4 16.78 9.7Z"
          fill="#0ABF8C"
        />
      </svg>
    ),
  },
  {
    status: 'post',
    name: 'تحویل به پست',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M18.34 14.13L16.16 12.38C15.85 12.14 15.46 12 15.06 12H12.75V9H17.22C18.19 9 18.97 8.22 18.97 7.25V3.75C18.97 2.78 18.19 2 17.22 2H8.95997C8.56997 2 8.17997 2.14 7.86997 2.38L5.67997 4.13C4.80997 4.83 4.80997 6.17 5.67997 6.87L7.86997 8.62C8.17997 8.86 8.56997 9 8.95997 9H11.25V12H6.79997C5.82997 12 5.04997 12.78 5.04997 13.75V17.25C5.04997 18.22 5.82997 19 6.79997 19H11.25V21.25H8.99997C8.58997 21.25 8.24997 21.59 8.24997 22C8.24997 22.41 8.58997 22.75 8.99997 22.75H15C15.41 22.75 15.75 22.41 15.75 22C15.75 21.59 15.41 21.25 15 21.25H12.75V19H15.06C15.46 19 15.85 18.86 16.16 18.62L18.34 16.87C19.22 16.17 19.22 14.83 18.34 14.13Z"
          fill="#1DA1F3"
        />
      </svg>
    ),
  },
  {
    status: 'Delivery',
    name: 'تحویل به پست',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M18.34 14.13L16.16 12.38C15.85 12.14 15.46 12 15.06 12H12.75V9H17.22C18.19 9 18.97 8.22 18.97 7.25V3.75C18.97 2.78 18.19 2 17.22 2H8.95997C8.56997 2 8.17997 2.14 7.86997 2.38L5.67997 4.13C4.80997 4.83 4.80997 6.17 5.67997 6.87L7.86997 8.62C8.17997 8.86 8.56997 9 8.95997 9H11.25V12H6.79997C5.82997 12 5.04997 12.78 5.04997 13.75V17.25C5.04997 18.22 5.82997 19 6.79997 19H11.25V21.25H8.99997C8.58997 21.25 8.24997 21.59 8.24997 22C8.24997 22.41 8.58997 22.75 8.99997 22.75H15C15.41 22.75 15.75 22.41 15.75 22C15.75 21.59 15.41 21.25 15 21.25H12.75V19H15.06C15.46 19 15.85 18.86 16.16 18.62L18.34 16.87C19.22 16.17 19.22 14.83 18.34 14.13Z"
          fill="#1DA1F3"
        />
      </svg>
    ),
  },
  {
    status: 'published',
    name: 'تائید شده',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M18.34 14.13L16.16 12.38C15.85 12.14 15.46 12 15.06 12H12.75V9H17.22C18.19 9 18.97 8.22 18.97 7.25V3.75C18.97 2.78 18.19 2 17.22 2H8.95997C8.56997 2 8.17997 2.14 7.86997 2.38L5.67997 4.13C4.80997 4.83 4.80997 6.17 5.67997 6.87L7.86997 8.62C8.17997 8.86 8.56997 9 8.95997 9H11.25V12H6.79997C5.82997 12 5.04997 12.78 5.04997 13.75V17.25C5.04997 18.22 5.82997 19 6.79997 19H11.25V21.25H8.99997C8.58997 21.25 8.24997 21.59 8.24997 22C8.24997 22.41 8.58997 22.75 8.99997 22.75H15C15.41 22.75 15.75 22.41 15.75 22C15.75 21.59 15.41 21.25 15 21.25H12.75V19H15.06C15.46 19 15.85 18.86 16.16 18.62L18.34 16.87C19.22 16.17 19.22 14.83 18.34 14.13Z"
          fill="#1DA1F3"
        />
      </svg>
    ),
  },
  {
    status: 'back',
    name: 'مرجوعی',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M14.35 2H9.65001C8.61001 2 7.76001 2.84 7.76001 3.88V4.82C7.76001 5.86 8.60001 6.7 9.64001 6.7H14.35C15.39 6.7 16.23 5.86 16.23 4.82V3.88C16.24 2.84 15.39 2 14.35 2Z"
          fill="#E52A35"
        />
        <path
          d="M17.24 4.82047C17.24 6.41047 15.94 7.71047 14.35 7.71047H9.65004C8.06004 7.71047 6.76004 6.41047 6.76004 4.82047C6.76004 4.26047 6.16004 3.91047 5.66004 4.17047C4.25004 4.92047 3.29004 6.41047 3.29004 8.12047V17.5305C3.29004 19.9905 5.30004 22.0005 7.76004 22.0005H16.24C18.7 22.0005 20.71 19.9905 20.71 17.5305V8.12047C20.71 6.41047 19.75 4.92047 18.34 4.17047C17.84 3.91047 17.24 4.26047 17.24 4.82047ZM14.53 16.6905C14.38 16.8405 14.19 16.9105 14 16.9105C13.81 16.9105 13.62 16.8405 13.47 16.6905L12.02 15.2405L10.53 16.7305C10.38 16.8805 10.19 16.9505 10 16.9505C9.81004 16.9505 9.62004 16.8805 9.47004 16.7305C9.18004 16.4405 9.18004 15.9605 9.47004 15.6705L10.96 14.1805L9.51004 12.7305C9.22004 12.4405 9.22004 11.9605 9.51004 11.6705C9.80004 11.3805 10.28 11.3805 10.57 11.6705L12.02 13.1205L13.42 11.7205C13.71 11.4305 14.19 11.4305 14.48 11.7205C14.77 12.0105 14.77 12.4905 14.48 12.7805L13.08 14.1805L14.53 15.6305C14.82 15.9205 14.82 16.3905 14.53 16.6905Z"
          fill="#E52A35"
        />
      </svg>
    ),
  },
  {
    status: 'waiting',
    name: 'در انتظار بررسی',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M22 21.25C22 21.66 21.66 22 21.25 22H2.75C2.34 22 2 21.66 2 21.25C2 20.84 2.34 20.5 2.75 20.5H21.25C21.66 20.5 22 20.84 22 21.25Z"
          fill="#FFA216"
        />
        <path
          d="M15.3899 4.51977L4.64994 15.2598C4.23994 15.6698 3.57994 15.6698 3.17994 15.2598H3.16994C1.77994 13.8598 1.77994 11.5998 3.16994 10.2098L10.3199 3.05977C11.7199 1.65977 13.9799 1.65977 15.3799 3.05977C15.7899 3.44977 15.7899 4.11977 15.3899 4.51977Z"
          fill="#FFA216"
        />
        <path
          d="M20.8199 8.49031L17.7699 5.44031C17.3599 5.03031 16.6999 5.03031 16.2999 5.44031L5.55994 16.1803C5.14994 16.5803 5.14994 17.2403 5.55994 17.6503L8.60994 20.7103C10.0099 22.1003 12.2699 22.1003 13.6699 20.7103L20.8099 13.5603C22.2299 12.1603 22.2299 9.89031 20.8199 8.49031ZM12.7599 17.5203L11.5499 18.7403C11.2999 18.9903 10.8899 18.9903 10.6299 18.7403C10.3799 18.4903 10.3799 18.0803 10.6299 17.8203L11.8499 16.6003C12.0899 16.3603 12.5099 16.3603 12.7599 16.6003C13.0099 16.8503 13.0099 17.2803 12.7599 17.5203ZM16.7299 13.5503L14.2899 16.0003C14.0399 16.2403 13.6299 16.2403 13.3699 16.0003C13.1199 15.7503 13.1199 15.3403 13.3699 15.0803L15.8199 12.6303C16.0599 12.3903 16.4799 12.3903 16.7299 12.6303C16.9799 12.8903 16.9799 13.3003 16.7299 13.5503Z"
          fill="#FFA216"
        />
      </svg>
    ),
  },
  {
    status: 'Awaiting',
    name: 'در انتظار پرداخت',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M22 21.25C22 21.66 21.66 22 21.25 22H2.75C2.34 22 2 21.66 2 21.25C2 20.84 2.34 20.5 2.75 20.5H21.25C21.66 20.5 22 20.84 22 21.25Z"
          fill="#FFA216"
        />
        <path
          d="M15.3899 4.51977L4.64994 15.2598C4.23994 15.6698 3.57994 15.6698 3.17994 15.2598H3.16994C1.77994 13.8598 1.77994 11.5998 3.16994 10.2098L10.3199 3.05977C11.7199 1.65977 13.9799 1.65977 15.3799 3.05977C15.7899 3.44977 15.7899 4.11977 15.3899 4.51977Z"
          fill="#FFA216"
        />
        <path
          d="M20.8199 8.49031L17.7699 5.44031C17.3599 5.03031 16.6999 5.03031 16.2999 5.44031L5.55994 16.1803C5.14994 16.5803 5.14994 17.2403 5.55994 17.6503L8.60994 20.7103C10.0099 22.1003 12.2699 22.1003 13.6699 20.7103L20.8099 13.5603C22.2299 12.1603 22.2299 9.89031 20.8199 8.49031ZM12.7599 17.5203L11.5499 18.7403C11.2999 18.9903 10.8899 18.9903 10.6299 18.7403C10.3799 18.4903 10.3799 18.0803 10.6299 17.8203L11.8499 16.6003C12.0899 16.3603 12.5099 16.3603 12.7599 16.6003C13.0099 16.8503 13.0099 17.2803 12.7599 17.5203ZM16.7299 13.5503L14.2899 16.0003C14.0399 16.2403 13.6299 16.2403 13.3699 16.0003C13.1199 15.7503 13.1199 15.3403 13.3699 15.0803L15.8199 12.6303C16.0599 12.3903 16.4799 12.3903 16.7299 12.6303C16.9799 12.8903 16.9799 13.3003 16.7299 13.5503Z"
          fill="#FFA216"
        />
      </svg>
    ),
  },
  {
    status: 'doing',
    name: 'در حال انجام',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M17.39 15.67L13.35 12H10.64L6.59998 15.67C5.46998 16.69 5.09998 18.26 5.64998 19.68C6.19998 21.09 7.53998 22 9.04998 22H14.94C16.46 22 17.79 21.09 18.34 19.68C18.89 18.26 18.52 16.69 17.39 15.67ZM13.82 18.14H10.18C9.79998 18.14 9.49998 17.83 9.49998 17.46C9.49998 17.09 9.80998 16.78 10.18 16.78H13.82C14.2 16.78 14.5 17.09 14.5 17.46C14.5 17.83 14.19 18.14 13.82 18.14Z"
          fill="#1DA1F3"
        />
        <path
          d="M18.35 4.32C17.8 2.91 16.46 2 14.95 2H9.05004C7.54004 2 6.20004 2.91 5.65004 4.32C5.11004 5.74 5.48004 7.31 6.61004 8.33L10.65 12H13.36L17.4 8.33C18.52 7.31 18.89 5.74 18.35 4.32ZM13.82 7.23H10.18C9.80004 7.23 9.50004 6.92 9.50004 6.55C9.50004 6.18 9.81004 5.87 10.18 5.87H13.82C14.2 5.87 14.5 6.18 14.5 6.55C14.5 6.92 14.19 7.23 13.82 7.23Z"
          fill="#1DA1F3"
        />
      </svg>
    ),
  },
  {
    status: 'Doing',
    name: 'در حال انجام',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M17.39 15.67L13.35 12H10.64L6.59998 15.67C5.46998 16.69 5.09998 18.26 5.64998 19.68C6.19998 21.09 7.53998 22 9.04998 22H14.94C16.46 22 17.79 21.09 18.34 19.68C18.89 18.26 18.52 16.69 17.39 15.67ZM13.82 18.14H10.18C9.79998 18.14 9.49998 17.83 9.49998 17.46C9.49998 17.09 9.80998 16.78 10.18 16.78H13.82C14.2 16.78 14.5 17.09 14.5 17.46C14.5 17.83 14.19 18.14 13.82 18.14Z"
          fill="#1DA1F3"
        />
        <path
          d="M18.35 4.32C17.8 2.91 16.46 2 14.95 2H9.05004C7.54004 2 6.20004 2.91 5.65004 4.32C5.11004 5.74 5.48004 7.31 6.61004 8.33L10.65 12H13.36L17.4 8.33C18.52 7.31 18.89 5.74 18.35 4.32ZM13.82 7.23H10.18C9.80004 7.23 9.50004 6.92 9.50004 6.55C9.50004 6.18 9.81004 5.87 10.18 5.87H13.82C14.2 5.87 14.5 6.18 14.5 6.55C14.5 6.92 14.19 7.23 13.82 7.23Z"
          fill="#1DA1F3"
        />
      </svg>
    ),
  },
  {
    status: 'Review',
    name: 'در انتظار بررسی',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M18 4H15.75V2.75C15.75 2.34 15.41 2 15 2C14.59 2 14.25 2.34 14.25 2.75V21.25C14.25 21.66 14.59 22 15 22C15.41 22 15.75 21.66 15.75 21.25V20H18C20.21 20 22 18.21 22 16V8C22 5.79 20.21 4 18 4Z"
          fill="#FFA216"
        />
        <path
          d="M6.5 4C4.29 4 2.5 5.79 2.5 8V16C2.5 18.21 4.29 20 6.5 20H11.5C12.05 20 12.5 19.55 12.5 19V5C12.5 4.45 12.05 4 11.5 4H6.5ZM6.67 12.38C6.62 12.5 6.55 12.61 6.46 12.71C6.36 12.8 6.25 12.87 6.13 12.92C6.01 12.97 5.88 13 5.75 13C5.62 13 5.49 12.97 5.37 12.92C5.25 12.87 5.14 12.8 5.04 12.71C4.95 12.61 4.88 12.5 4.82 12.38C4.77 12.26 4.75 12.13 4.75 12C4.75 11.74 4.86 11.48 5.04 11.29C5.09 11.25 5.14 11.21 5.19 11.17C5.25 11.13 5.31 11.1 5.37 11.08C5.43 11.05 5.49 11.03 5.55 11.02C5.89 10.95 6.23 11.06 6.46 11.29C6.64 11.48 6.75 11.74 6.75 12C6.75 12.13 6.72 12.26 6.67 12.38ZM10.17 12.38C10.12 12.5 10.05 12.61 9.96 12.71C9.86 12.8 9.75 12.87 9.63 12.92C9.51 12.97 9.38 13 9.25 13C9.12 13 8.99 12.97 8.87 12.92C8.75 12.87 8.64 12.8 8.54 12.71C8.35 12.52 8.25 12.27 8.25 12C8.25 11.87 8.28 11.74 8.33 11.62C8.38 11.49 8.45 11.39 8.54 11.29C8.91 10.92 9.58 10.92 9.96 11.29C10.14 11.48 10.25 11.74 10.25 12C10.25 12.13 10.22 12.26 10.17 12.38Z"
          fill="#FFA216"
        />
      </svg>
    ),
  },
  {
    status: 'Canceled',
    name: 'کنسل شده',
    icon: (
      <svg
        width="24"
        height="24"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M14.35 2H9.65001C8.61001 2 7.76001 2.84 7.76001 3.88V4.82C7.76001 5.86 8.60001 6.7 9.64001 6.7H14.35C15.39 6.7 16.23 5.86 16.23 4.82V3.88C16.24 2.84 15.39 2 14.35 2Z"
          fill="#E52A35"
        />
        <path
          d="M17.24 4.82047C17.24 6.41047 15.94 7.71047 14.35 7.71047H9.65004C8.06004 7.71047 6.76004 6.41047 6.76004 4.82047C6.76004 4.26047 6.16004 3.91047 5.66004 4.17047C4.25004 4.92047 3.29004 6.41047 3.29004 8.12047V17.5305C3.29004 19.9905 5.30004 22.0005 7.76004 22.0005H16.24C18.7 22.0005 20.71 19.9905 20.71 17.5305V8.12047C20.71 6.41047 19.75 4.92047 18.34 4.17047C17.84 3.91047 17.24 4.26047 17.24 4.82047ZM14.53 16.6905C14.38 16.8405 14.19 16.9105 14 16.9105C13.81 16.9105 13.62 16.8405 13.47 16.6905L12.02 15.2405L10.53 16.7305C10.38 16.8805 10.19 16.9505 10 16.9505C9.81004 16.9505 9.62004 16.8805 9.47004 16.7305C9.18004 16.4405 9.18004 15.9605 9.47004 15.6705L10.96 14.1805L9.51004 12.7305C9.22004 12.4405 9.22004 11.9605 9.51004 11.6705C9.80004 11.3805 10.28 11.3805 10.57 11.6705L12.02 13.1205L13.42 11.7205C13.71 11.4305 14.19 11.4305 14.48 11.7205C14.77 12.0105 14.77 12.4905 14.48 12.7805L13.08 14.1805L14.53 15.6305C14.82 15.9205 14.82 16.3905 14.53 16.6905Z"
          fill="#E52A35"
        />
      </svg>
    ),
  },
];

export const province = [
  { value: 'East-Azerbaijan', label: 'آذربایجان شرقی' },
  { value: 'West-Azerbaijan', label: 'آذربایجان غربی' },
  { value: 'Ardabil', label: 'اردبیل' },
  { value: 'Isfahan', label: 'اصفهان' },
  { value: 'Alborz', label: 'البرز' },
  { value: 'Ilam', label: 'ایلام' },
  { value: 'Bushehr', label: 'بوشهر' },
  { value: 'Tehran', label: 'تهران' },
  { value: 'Chaharmahal-Bakhtiari', label: 'چهارمحال و بختیاری' },
  { value: 'South-Khorasan', label: 'خراسان جنوبی' },
  { value: 'Razavi-Khorasan', label: 'خراسان رضوی' },
  { value: 'North-Khorasan', label: 'خراسان شمالی' },
  { value: 'Khuzestan', label: 'خوزستان' },
  { value: 'Zanjan', label: 'زنجان' },
  { value: 'Semnan', label: 'سمنان' },
  { value: 'Sistan-Baluchestan', label: 'سیستان و بلوچستان' },
  { value: 'Fars', label: 'فارس' },
  { value: 'Qazvin', label: 'قزوین' },
  { value: 'Qom', label: 'قم' },
  { value: 'Kurdistan', label: 'کردستان' },
  { value: 'Kerman', label: 'کرمان' },
  { value: 'Kermanshah', label: 'کرمانشاه' },
  { value: 'Kohgiluyeh-Boyer-Ahmad', label: 'کهگیلویه وبویراحمد' },
  { value: 'Golestan', label: 'گلستان' },
  { value: 'Gilan', label: 'گیلان' },
  { value: 'Lorestan', label: 'لرستان' },
  { value: 'Mazandaran', label: 'مازندران' },
  { value: 'Markazi', label: 'مرکزی' },
  { value: 'Hormozgan', label: 'هرمزگان' },
  { value: 'Hamedan', label: 'همدان' },
  { value: 'Yazd', label: 'یزد' },
];

export const optionRedirectType = [
  { label: 'انتقال دائم', value: '301' },
  { label: 'انتقال موقت', value: '302' },
  { label: 'محتوای حذف شده', value: '410' },
  { label: 'خالی', value: '0' },
];

export const ordersStatus = [
  {
    label: 'در انتظار پرداخت',
    value: 'Awaiting',
  },
  {
    label: 'در حال انجام',
    value: 'Doing',
  },
  {
    label: 'در انتظار بررسی',
    value: 'Review',
  },
  {
    label: 'تحویل به پست',
    value: 'Delivery',
  },
  {
    label: 'ارسال شده',
    value: 'Posted',
  },
  {
    label: 'لغو شده',
    value: 'Canceled',
  },
];

export const StatusOptionsAdmin = [
  { label: 'پیش نمایش', value: 'false' },
  { label: 'انتشار', value: 'true' },
];

export const QuestionSendProducts = [
  {
    question: 'هزینه ارسال کالا چقدر است ؟',
    answer:
      'هزینه ی ارسال برای ساکنین قم با پیک 25,000 تومان و برای شهرهای دیگر با پست پیشتاز 502,000 تومان است.',
  },
  {
    question: 'شرایط بازگشت وجه و مرجوع کردن کالا به چه صورت است؟',
    answer: `
        با شماره‌ی 32140(025) تماس بگیرید و درخواست مرجوع کردن کالای خود را اعلام کنید، در صورت داشتن شرایط مرجوعی، کالای مورد نظر با هزینه‌ی ما برگشته و همینطور وجه شما عودت داده می‌شود.
 
شرایط تعویض کالا، مرجوعی و بازگشت وجه:
 
تعویض:
درصورتی که شما نظر به تعویض کالا داشته باشید به شرط این که پلمپ کالا باز نشده باشد و کالای مورد نظر استفاده نشده و آسیبی ندیده باشد، امکان تعویض کالا وجود خواهد داشت (این موارد توسط کارشناس مربوطه بررسی خواهند شد)
 
بازگشت وجه:
 در صورتی که کالای مورد نظر باز نشده و استفاده نشده باشد و به صورت پلمپ باقی مانده باشد، هزینه‌ی سفارش مرجوع می‌گردد، در غیر این صورت امکان مرجوع کردن کالا و بازگشت وجه موجود نیست.
 
هزینه‌ی پستی بازگرداندن سفارش:
در تمامی حالات تعویض و یا بازگشت وجه و … درصورتی که قصور و کوتاهی از طرف مجموعه‌ی ما باشد(مواردی مثل معیوب بودن کالا و …)، هزینه‌ی پستی عودت کالا بر عهده‌ی ما و در غیر این صورت بر عهده‌ی شما خواهد بود.
 
نکته: در صورتی که در سبد کالاهای دریافتی شما موردی ارسال نشده باشد، مبلغ متناظر با کالای مذکور به رزکارت شما واریز شده و در صورتی که شما مبلغ کمتری پرداخت کرده باشید و کالاهای بیشتری دریافت کرده باشید، مبلغ کالای مورد نظر متعاقبا از شما دریافت خواهد شد.
        `,
  },
  {
    question: 'مدت زمان ارسال کالا به چه صورت میباشد ؟',
    answer:
      'مجموعه ی تکتم هر روز به جز ایام تعطیل و جمعه ها بسته های پستی شما را در ساعت 11 صبح ارسال میکند. از آنجا که مرکز ارسال تکتم در قم واقع شده ،زمان تحویل بسته های پستی به 3 دسته زیر تقسیم بندی می شود: شهر قم : از زمان سفارش تا نهایتا ساعت 22 روز بعد بسته تحویل داده می شود. برای مشتریان عزیز تهرانی هم امکان دریافت سفارشات به صورت ویژه و یک روزه نیز فراهم است. شهر های نزدیک(تهران، کاشان،ساوه،اراک):حداکثر بین 2 تا 4 روز کاری. شهر های دور:بین 5 تا 7 روز کاری.',
  },
  {
    question: 'چجوری میتونم کالایی که خریداری کردم مرجوع کنم ؟',
    answer:
      'با شماره ی 32140(025) تماس بگیرید و در خواست مرجوع کردن کالا رو اعلام کنید در صورت داشتن شرایط کالای شمارو مرجوع میکنیم.',
  },
  {
    question: 'چجوری میتونم سفارش خودم رو پیگیری کنم ؟',
    answer: 'میتوانید با ورود به حساب کاربری و قسمت سفارشات از وضعیت سفارش خود اطلاع پیدا کنید.',
  },
  {
    question: 'امکان ارسال سفارش کالا به آدرس دیگری وجود دارد ؟',
    answer:
      'بله، اگر سفارش شما ارسال نشده باشد، شما می‌توانید با وارد کردن آدرس جدید داخل حساب کاربری خود سفارش خودتون رو به آدرس دیگری ارسال کنید.',
  },
  {
    question: 'امکان تحویل حضوری کالا وجود دارد؟',
    answer:
      'فروشگاه اینترنتی تکتم دارای فروشگاه حضوری نیز می‌باشد که در صورت نیاز می‌توانید سفارش خود را به صورت حضوری دریافت کنید.',
  },
  {
    question: 'کالایی که میخوام مرجوع کنم به چه صورت بسته بندی کنم ؟',
    answer:
      'کالاهای شکننده مانند آینه باید حتما با استفاده از ضربه گیر دور آن را محکم بپوشانید و برای دسته کالا های لوزام آرایشی و بهداشتی حتما به صورت صاف در جعبه پستی قرار داده شود و فضای خالی اطراف آن را با استفاده از کارتن یا کاغذ پر کنید.',
  },
  {
    question: 'چگونه سفارش خودم را از پست پیشتاز پیگیری کنم ؟',
    answer:
      'تکتم مرسوله های خود را بسته به شهر مورد نظر شما از طریق پست یا تیپاکس ارسال می نماید. در هر صورت بلافاصله پس از تحویل بسته به پست یا تیپاکس کد رهگیری کالا از طریق پیامک برای شما ارسال میشود. و می توانید از سامانه رهگیری مرسولات پستی از سامانه رهگیری مرسولات تیپاکس وضعیت مرسوله خود مطلع شوید.',
  },
  {
    question: 'اگر پس از زمان مورد نیاز کالا به دستم نرسید چگونه میتونم پیگیری کنم ؟',
    answer:
      'ما در تکتم تمام تلاش خود را میکنیم که روند تحویل کالا به اداره پست در سریع ترین زمان ممکن انجام شود. همچنین اگر دیرکرد از سمت پست باشد تکتم هیچ مسئولیتی را نمی پذیرد. اگر در روند پیگیری سفارش به مشکل برخوردید میتوانید با پیشتیبانی ارتباط برقرار کنید تا شمارا راهنمایی کنند.',
  },
  {
    question: 'آیا ارسال رایگان برای تمامی کالا ها لحاظ میشود ؟',
    answer: `ارسال رایگان برای تمامی کالاهایی که بالای ${freeShippingPrice.toLocaleString()} تومان است بدون در نظر گرفتن تعداد دفعات سفارش لحاظ می‌شود.`,
  },
];

export const QuestionProduct = [
  {
    question: 'شرایط ضمانت بازگشت 7 روزه کالا به چه صورت است ؟',
    answer:
      'بازگشت کالاها بعد از 7روز فقط در صورتی امکان پذیر است که پلمپ کالا باز نشده باشد. اگر کالا در فرایند ارسال دچار مشکل شده باشد. در صورت تایید کارشناس مرجوع می شود.',
  },
  {
    question: 'آیا امکان تعویض کالای خریداری شده وجود دارد؟',
    answer:
      'تعویض فقط در صورتی امکان پذیر است که جزِو گزینه های زیر نباشد: × پلمپ کالا باز شده باشد. × از محصول استفاده شده باشد. × بعد از تحویل ، مرسوله دچار شکستگی و غیره… نشده باشد.',
  },
  {
    question: 'تاریخ انقضاء محصولات چقدر است؟',
    answer:
      'تمامی کالاهای موجود در تکتم بالای 6 ماه انقضاء دارد و این تاریخ انقضاء تضمین می‌شود. در صورتی که تاریخ انقضاء محصولی کمتر از مقدار ذکر شده باشد به اطلاع مشتری میرسد تا مشتری با آگاهی کامل کالا را خرید کند.',
  },
  {
    question: 'در صورت نداشتن تاریخ انقضاء میتوانم کالا مرجوع کنم ؟',
    answer:
      'پس از اینکه از اتمام تاریخ انقضاء محصول اطمینان حاصل کردید میتوانید کالای مورد نظر را مرجوع کنید.',
  },
  {
    question: 'در صورت پسند نکردن کالا میتوانم آن را مرجوع کنم ؟',
    answer: 'در صورت باز نشدن پلمپ کالا داشتن شرایط بازگشت میتوانید کالا را مرجوع کنید.',
  },
  {
    question: 'تا چه زمانی امکان مروجوع کردن کالا وجود دارد ؟',
    answer:
      'حداکثر زمان قابل قبول برای مرجوع کردن کالا 10 روز می‌باشد. و باید در مدت زمان 10 روز حتما با پشتیبانی برای مرجوع کردن ارتباط برقرار کرده باشید.',
  },
  {
    question: 'آیا امکان ثبت سفارش تلفنی وجود دارد؟',
    answer: 'بله شما میتوانید با شماره گیری 32140(025) سفارش خود را به صورت تلفنی ثبت نمایید.',
  },
  {
    question: 'چجوری از تخفیف ها و جشنواره ها مطلع بشم ؟',
    answer:
      'برای اطلاع از تخفیف ها و جشنواره میتوانید با وارد کردن شماره همراه خود در باکسی که در پابرگ سایت وجود دارد، به علاوه با دنبال کردن شبکه های اجتماعی فروشگاه با خبر شوید.',
  },
  {
    question: 'چگونه از موجود شدن کالایی مطلع بشم؟',
    answer:
      'شما میتونید با فعال سازی آیکون زنگوله پایین تصویر محصول از موجود و ناموجود شدن محصول مطلع شوید.',
  },
];

export const QuestionFinancial = [
  {
    question: 'نحوه پرداخت سایت به چه صورت است؟',
    answer:
      'نحوه ی پرداخت در فروشگاه تکتم به صورت نقد و اقساط است. برای پرداخت نقدی کافی است یکی از درگاه های پرداخت موجود را انتخاب کنید و برای خرید اقساطی از طریق درگاه پرداخت اسنپ پی استفاده کنید.',
  },
  {
    question: 'چگونه می تونم به صورت قسطی از سایت تکتم خرید کنم؟',
    answer:
      'نحوه ی پرداخت قسطی از تکتم فقط از طریق درگاه اسنپ پی به صورت 4 قسطه و بدون کارمزد و سود امکان پذیر است. سقف خرید مجاز شما بسته به اعتبار اسنپ پی شما متغیر می‌باشد.',
  },
  {
    question: 'پرداخت ناموفق بوده است ولی مبلغ از حساب بانکی کم شده است؟',
    answer:
      'در صورتی که مبلغ تا 48 ساعت به حساب بازگردانده نشد با پشتیبانی به شماره 02532140 تماس بگیرید.',
  },
  {
    question: 'هزینه کالای مرجوع شده چگونه به حساب من بازگردانده میشود ؟',
    answer: 'پس از ارسال کالا توسط شما نهایتا تا 24 ساعت آینده پول به حساب شما برگشت زده خواهد شد.',
  },
  {
    question: 'آیا میتوانم هزینه رو درب منزل پرداخت کنم ؟',
    answer:
      'خرید آنلاین از سایت تکتم از طریق درگاه زرین پال و ملت یا درگاه اسنپ پی برای انجام سفارشات قسطی صورت می‌پذیرد. اما ساکنین شهر قم می‌توانند درخواست پرداخت در محل را نیز انتخاب کنند.',
  },
];

export const questionSite = [
  {
    question: 'چجوری میتونم از سایت خرید بکنم ؟',
    answer:
      'شما با ساخت حساب کاربری و انتخاب محصول مورد نظر میتوانید سفارش خودتان را داخل سایت ثبت نمایید در صورت نیاز به آموزش میتوانید به صفحه راهنمای خرید از سایت مراجعه کنید.',
  },
  {
    question: 'چجوری میتونم از کد تخفیف استفاده کنم ؟',
    answer:
      'پس از اینکه محصول مورد نظر را داخل سبد خرید قرار دادید ، وارد صفحه بازبینی سفارش می‌شوید که باکس کد تخفیف در آن قسمت قرار دارد و می توانید کد تخفیف خود را در آن قسمت وارد کنید تا از مبلغ کلی سفارش شما کسر شود.',
  },
  {
    question: 'چگونه میتوانم مشاوره رایگان دریافت کنم ؟',
    answer:
      'شما میتوانید با شماره گیری 32140(025) و چت آنلاین وبسایت از مشاوره رایگان ما استفاده کنید.',
  },
  {
    question: 'چگونه میتوانم با پشتیانی ارتباط بر قرار کنم ؟',
    answer:
      'شما میتوانید با شماره گیری 32140(025) و چت آنلاین وبسایت با پشتیبان وبسایت ارتباط برقرار بکنید.',
  },
  {
    question: 'چگونه حساب کاربری بسازم ؟',
    answer:
      'با کلیک روی آیکون کاربر داخل سربرگ سایت وارد صفحه ثبت نام یا ورود به سایت می‌شوید که با وارد کردن شماره همراه خود می‌توانید حساب کاربری خود را ایجاد کنید.',
  },
  {
    question: 'رز کارت چیست؟',
    answer:
      'رز کارت سرویسی همانند کیف پول شما می‌باشد با امکانات بیشتر که تکتم برای مشتریان خود در نظر گرفته است. نمونه ای از امکانات رز کارت : با هر خرید از سایت تکتم 5% از مبلغ پرداختی توسط شما در رزکارت شما شارژ می شود و می توانید در خرید های بعدی از اعتبار رز کارت استفاده کنید.',
  },
  {
    question: 'با امتیاز های داخل حساب کاربریم چه کار میتوانم انجام بدهم ؟',
    answer:
      'شما میتوانید امتیاز هایی را که به دست آوردید را تبدیل به کد تخفیف کنید. برای اینکار به حساب کاربری خودتون مراجعه کنید و پلن های امتیازی را مشاهده کنید.',
  },
  {
    question: 'چگونه امتیاز های خودم را بیشتر کنم ؟',
    answer:
      'در مرحله اول شما می‌توانید با تکمیل کردن اطلاعات حساب کاربری خودتان امتیاز دریافت کنید و در قسمت اطلاعیه های سایت منتظر جشنواره، ماموریت و.. برای افزایش امتیاز از سمت تکتم باشید.',
  },
  {
    question: 'امکان ثبت سفارش بدون ایجاد حساب کاربری وجود دارد؟',
    answer: 'خیر شما برای ثبت سفارش احتیاج به ایجاد حساب کاربری دارید.',
  },
  {
    question: 'چگونه سفارش خود را داخل سایت لغو کنم ؟',
    answer: 'برای لغو سفارش با پشتیبانی 32140(025) تماس بگیرید.',
  },
  {
    question: 'پس از ثبت سفارش چگونه میتوانم سفارش خود را ویرایش کنم ؟',
    answer:
      'برای ویرایش سفارش خود، باید با پشتیبانی به شماره 32140(025) تماس گرفته و در خواست ویرایش سفارش دهید. ویرایش سفارش شما توسط پشتیبان انجام خواهد شد.',
  },
  {
    question: 'چجوری میتونم با تکتم همکاری کنم ؟',
    answer: 'شما میتوانید با مراجعه به صفحه فرصت های شغلی از نحوه همکاری با تکتم مطلع شوید.',
  },
  {
    question: 'سایت دارای اشکال فنی میباشد !',
    answer:
      'در صورت مشاهده مشکل فنی در سایت شما میتوانید با مراجعه به صفحه گزارش خطای سایت در فرم مشخص شده مشکل سایت را وارد کنید و از ما کد تخفیف دریافت کنید.',
  },
  {
    question: 'آیا برای ثبت نظر باید حساب کاربری ایجاد بکنم ؟',
    answer:
      'شما با ثبت نظر در سایت تکتم امتیاز کسب میکنید و میتوانید این امتیاز ها را به کد تخفیف تبدیل کنید و برای ثبت نظر محصولات در سایت باید حساب کاربری ایجاد کنید.',
  },
  {
    question: 'هدیه بازگشت چیست؟',
    answer:
      'هدیه بازگشت مبلغی است که با توجه به میزان خرید شما به حساب رز کارت شما عودت داده میشود که بتوانید در خرید های بعدی از آن اعتبار استفاده کنید.',
  },
];

export const permissions = [
  {
    label: 'صفحات',
    children: [
      { label: ' مشاهده جمعه سیاه و صفحه لندینگ ', value: 'VIEW_LANDINGPAGE' },
      { label: 'مشاهده صفحه اصلی', value: 'VIEW_MAINPAGE' },
      { label: 'افزودن صفحه اصلی', value: 'ADD_MAINPAGE' },
      { label: 'ویرایش صفحه اصلی', value: 'EDIT_MAINPAGE' },
      { label: 'افزودن  جمعه سیاه و صفحه لندینگ', value: 'ADD_LANDINGPAGE' },
      { label: 'ویرایش صفحه جمعه سیاه و صفحه لندینگ', value: 'EDIT_LANDINGPAGE' },
      { label: 'مشاهده صفحه برند', value: 'VIEW_BRANDPAGE' },
      { label: 'افزودن صفحه برند', value: 'ADD_BRANDPAGE' },
      { label: 'ویرایش صفحه برند', value: 'EDIT_BRANDPAGE' },
    ],
  },
  {
    label: 'مقالات',
    children: [
      { label: 'مشاهده مقاله', value: 'VIEW_MAG' },
      { label: 'افزودن مقاله', value: 'ADD_MAG' },
      { label: 'ویرایش مقاله', value: 'EDIT_MAG' },
      { label: 'حذف مقاله', value: 'DELETE_MAG' },
      { label: 'مشاهده برچسب مقاله', value: 'VIEW_MAG_TAG' },
      { label: 'افزودن برچسب مقاله', value: 'ADD_MAG_TAG' },
      { label: 'ویرایش برچسب مقاله', value: 'EDIT_MAG_TAG' },
      { label: 'حذف برچسب مقاله', value: 'DELETE_MAG_TAG' },
      { label: 'مشاهده دسته‌بندی مقاله', value: 'VIEW_MAG_CAT' },
      { label: 'افزودن دسته‌بندی مقاله', value: 'ADD_MAG_CAT' },
      { label: 'ویرایش دسته‌بندی مقاله', value: 'EDIT_MAG_CAT' },
      { label: 'حذف دسته‌بندی مقاله', value: 'DELETE_MAG_CAT' },
    ],
  },
  {
    label: 'تنظیمات سایت',
    children: [
      { label: 'ویرایش عدم ایندکس', value: 'EDIT_NOINDEX' },
      { label: 'ویرایش ارسال تراکم', value: 'EDIT_CONGESTIONSENDING' },
      { label: 'مشاهده تست', value: 'VIEW_TEST' },
      { label: 'مشاهده خطا', value: 'VIEW_ERROR' },
      { label: 'حذف خطا', value: 'DELETE_ERROR' },
    ],
  },
  {
    label: 'طرح های محصولات رایگان',
    children: [
      { label: 'مشاهده طرح کالای رایگان', value: 'VIEW_PLAN' },
      { label: 'افزودن طرح کالای رایگان', value: 'ADD_PLAN' },
      { label: 'ویرایش طرح کالای رایگان', value: 'EDIT_PLAN' },
      { label: 'حذف طرح کالای رایگان', value: 'DELETE_PLAN' },
    ],
  },

  {
    label: 'ارسال پیامک',
    children: [
      { label: 'مشاهده ارسال SMS', value: 'VIEW_SMSDELIVERY' },
      { label: 'افزودن ارسال SMS', value: 'ADD_SMSDELIVERY' },
      { label: 'ویرایش ارسال SMS', value: 'EDIT_SMSDELIVERY' },
      { label: 'حذف ارسال SMS', value: 'DELETE_SMSDELIVERY' },
    ],
  },
  {
    label: 'مدیریت نظرات',
    children: [
      { label: 'مشاهده نظر', value: 'VIEW_COMMENT' },
      { label: 'ویرایش نظر', value: 'EDIT_COMMENT' },
      { label: 'حذف نظر', value: 'DELETE_COMMENT' },
    ],
  },
  {
    label: 'مدیریت پرداخت ها',
    children: [{ label: 'مشاهده پرداخت', value: 'VIEW_PAYMENT' }],
  },
  {
    label: 'مدیریت فرم های تماس با ما',
    children: [
      { label: 'مشاهده تماس با ما', value: 'VIEW_CONTACTUS' },
      { label: 'حذف تماس با ما', value: 'DELETE_CONTACTUS' },
    ],
  },
  {
    label: 'مدیریت داشبورد',
    children: [
      { label: 'مشاهده داشبورد', value: 'VIEW_DASHBOARD' },
      { label: 'مشاهده اعتبار KNCredit', value: 'VIEW_KNCREDIT' },
    ],
  },
  {
    label: 'مدیریت حمل و نقل',
    children: [
      { label: 'مشاهده حمل و نقل', value: 'VIEW_TRANSPORT' },
      { label: 'افزودن حمل و نقل', value: 'ADD_TRANSPORT' },
      { label: 'ویرایش حمل و نقل', value: 'EDIT_TRANSPORT' },
      { label: 'حذف حمل و نقل', value: 'DELETE_TRANSPORT' },
    ],
  },
  {
    label: 'مدیریت کد تخفیف',
    children: [
      { label: 'مشاهده کد تخفیف', value: 'VIEW_DISCOUNTCODE' },
      { label: 'افزودن کد تخفیف', value: 'ADD_DISCOUNTCODE' },
      { label: 'ویرایش کد تخفیف', value: 'EDIT_DISCOUNTCODE' },
      { label: 'حذف کد تخفیف', value: 'DELETE_DISCOUNTCODE' },
    ],
  },
  {
    label: 'مدیریت کاربران',
    children: [
      { label: 'مشاهده همه کاربران', value: 'VIEW_ALLUSER' },
      { label: 'مشاهده کاربر', value: 'VIEW_USER' },
      { label: 'افزودن کاربر', value: 'ADD_USER' },
      { label: 'ویرایش کاربر', value: 'EDIT_USER' },
      { label: 'حذف کاربر', value: 'DELETE_USER' },
      { label: 'ویرایش دسترسی‌ها', value: 'EDIT_PERMISSIONS' },
    ],
  },
  {
    label: 'مدیریت منو سایت',
    children: [
      { label: 'مشاهده منو', value: 'VIEW_MENU' },
      { label: 'افزودن منو', value: 'ADD_MENU' },
      { label: 'ویرایش منو', value: 'EDIT_MENU' },
      { label: 'حذف منو', value: 'DELETE_MENU' },
    ],
  },
  {
    label: 'مدیریت رسانه',
    children: [
      { label: 'مشاهده رسانه', value: 'VIEW_MEDIA' },
      { label: 'افزودن رسانه', value: 'ADD_MEDIA' },
      { label: 'ویرایش رسانه', value: 'EDIT_MEDIA' },
      { label: 'حذف رسانه', value: 'DELETE_MEDIA' },
    ],
  },

  {
    label: 'مدیریت سفارشات',
    children: [
      { label: 'مشاهده سفارش', value: 'VIEW_ORDER' },
      { label: 'افزودن سفارش', value: 'ADD_ORDER' },
      { label: 'ویرایش سفارش', value: 'EDIT_ORDER' },
      { label: 'حذف سفارش', value: 'DELETE_ORDER' },
      { label: 'تعداد کل فروش سفارش', value: 'TOTALSELL_ORDER' },
      { label: 'مشاهده وضعیت اسنپ', value: 'VIEW_SNAPPSTATUS' },
    ],
  },
  {
    label: 'مدیریت اسلایدر تصاویر',
    children: [
      { label: 'مشاهده اسلاید تصاویر', value: 'VIEW_PICSLIDERS' },
      { label: 'افزودن اسلاید تصاویر', value: 'ADD_PICSLIDERS' },
      { label: 'ویرایش اسلاید تصاویر', value: 'EDIT_PICSLIDERS' },
      { label: 'حذف اسلاید تصاویر', value: 'DELETE_PICSLIDERS' },
      { label: 'مشاهده دسته‌بندی اسلاید تصاویر', value: 'VIEW_PS_CAT' },
      { label: 'افزودن دسته‌بندی اسلاید تصاویر', value: 'ADD_PS_CAT' },
      { label: 'ویرایش دسته‌بندی اسلاید تصاویر', value: 'EDIT_PS_CAT' },
      { label: 'حذف دسته‌بندی اسلاید تصاویر', value: 'DELETE_PS_CAT' },
    ],
  },
  {
    label: 'مدیریت محصولات',
    children: [
      { label: 'مشاهده محصول', value: 'VIEW_PRODUCT' },
      { label: 'افزودن محصول', value: 'ADD_PRODUCT' },
      { label: 'افزودن محصول متغیر', value: 'ADD_PRODUCT_VARIABLE' },
      { label: 'ویرایش محصول', value: 'EDIT_PRODUCT' },
      { label: 'ویرایش محصول متغیر', value: 'EDIT_PRODUCT_VARIABLE' },
      { label: 'حذف محصول', value: 'DELETE_PRODUCT' },
      { label: 'مشاهده دسته‌بندی محصول', value: 'VIEW_PRODUCT_CAT' },
      { label: 'افزودن دسته‌بندی محصول', value: 'ADD_PRODUCT_CAT' },
      { label: 'ویرایش دسته‌بندی محصول', value: 'EDIT_PRODUCT_CAT' },
      { label: 'حذف دسته‌بندی محصول', value: 'DELETE_PRODUCT_CAT' },
      { label: 'مشاهده برچسب محصول', value: 'VIEW_PRODUCT_TAG' },
      { label: 'افزودن برچسب محصول', value: 'ADD_PRODUCT_TAG' },
      { label: 'ویرایش برچسب محصول', value: 'EDIT_PRODUCT_TAG' },
      { label: 'حذف برچسب محصول', value: 'DELETE_PRODUCT_TAG' },
      { label: 'مشاهده ویژگی محصول', value: 'VIEW_PRODUCT_PROP' },
      { label: 'افزودن ویژگی محصول', value: 'ADD_PRODUCT_PROP' },
      { label: 'ویرایش ویژگی محصول', value: 'EDIT_PRODUCT_PROP' },
      { label: 'حذف ویژگی محصول', value: 'DELETE_PRODUCT_PROP' },
      { label: 'مشاهده صفت محصول', value: 'VIEW_PRODUCT_ATT' },
      { label: 'افزودن صفت محصول', value: 'ADD_PRODUCT_ATT' },
      { label: 'ویرایش صفت محصول', value: 'EDIT_PRODUCT_ATT' },
      { label: 'حذف صفت محصول', value: 'DELETE_PRODUCT_ATT' },
      { label: 'مشاهده گروه خواص', value: 'VIEW_PEROPERTIESGROUPE' },
      { label: 'افزودن گروه خواص', value: 'ADD_PEROPERTIESGROUPE' },
      { label: 'ویرایش گروه خواص', value: 'EDIT_PEROPERTIESGROUPE' },
      { label: 'حذف گروه خواص', value: 'DELETE_PEROPERTIESGROUPE' },
    ],
  },
];

export const brandOptions = [
  {
    label: 'سکشن اول',
    value: 'sec1',
  },
  {
    label: 'سکشن دوم',
    value: 'sec2',
  },
  {
    label: 'سکشن سوم',
    value: 'sec3',
  },
  {
    label: 'سکشن چهارم',
    value: 'sec4',
  },
  {
    label: 'سکشن پنجم',
    value: 'sec5',
  },
  {
    label: 'سکشن ششم',
    value: 'sec6',
  },
  {
    label: 'سکشن هفتم',
    value: 'sec7',
  },
  {
    label: 'سکشن هشتم',
    value: 'sec8',
  },
  {
    label: 'سکشن نهم',
    value: 'sec9',
  },
];

export const landingOptions = [
  {
    label: 'بنر بالا',
    value: 'top-banner',
  },
  {
    label: 'سکشن اول',
    value: 'sec1',
  },
  {
    label: 'سکشن دوم',
    value: 'sec2',
  },
  {
    label: 'سکشن سوم',
    value: 'sec3',
  },
  {
    label: 'سکشن چهارم',
    value: 'sec4',
  },
  {
    label: 'سکشن پنجم',
    value: 'sec5',
  },
  {
    label: 'سکشن ششم',
    value: 'sec6',
  },
  {
    label: 'سکشن هفتم',
    value: 'sec7',
  },
  {
    label: 'سکشن هشتم',
    value: 'sec8',
  },
  {
    label: 'سکشن نهم',
    value: 'sec9',
  },
  {
    label: 'سکشن دهم',
    value: 'sec10',
  },
  {
    label: 'سکشن یازدهم',
    value: 'sec11',
  },
  {
    label: 'سکشن دوازدهم',
    value: 'sec12',
  },
  {
    label: 'سکشن سیزدهم',
    value: 'sec13',
  },
];

export const pages = [
  '/',
  '/product',
  '/product-category',
  '/mag',
  '/about-us',
  '/brands',
  '/common-questions',
  '/contact-us',
  '/guide',
  '/product_brand',
  '/product-tag',
  '/result',
  '/shop',
  '/site-error-report',
  '/profile',
  '/cart',
  '/address',
  '/checkout',
  '/home',
  '/license',
  '/auth',
  '/verify',
  '/admin',
  '/festival',
  '/buy-now-pay-later',
  '/rosetime',
  '/nowruz-white-rose',
  '/yalda-festival',
  '/buy-one-get-two',
  '/search-and-win-a-prize',
  '/love-day',
  '/mother-day',
  '/fortune-wheel',
  '/career-opportunities',
  '/low-price-products',
  '/spring-and-summer-products',
  '/fathers-day',
  '/summer-off',
  '/magazine',
  '/pages',
  '/too-many-request',
  '/products',
  '/print',
];

export const sorts = [
  {
    name: 'جدیدترین',
    sort: 'createdAt_desc',
  },

  {
    name: 'قدیمی‌ترین',
    sort: 'createdAt_asc',
  },
];
