'use client';
import { useState } from 'react';
import Button from '../common/Button';
import { Arrow_back_mobile } from '../common/icon';

export default function RozSefidContent() {
  const [open, setOpen] = useState(false);
  return (
    <div>
      <div
        className={`container_page container_des_category mt-14 overflow-hidden font-medium leading-8 ${open ? '' : '!h-[250px]'}`}
        style={{ height: 'auto' }}
      >
        <h1 className="text-2xl lg:text-3xl">
          رز سفید، مرجع تخصصی لوازم آرایشی، عطر و محصولات پوستی
        </h1>
        <p>
          خرید آنلاین لوازم آرایشی، عطر، لوازم بهداشتی و محصولات مراقبتی پوست، نیازمند انتخاب یک
          فروشگاه مناسب است. این فروشگاه علاوه بر ارائه محصولات اورجینال، باید محصولات را در سریع
          ترین زمان ممکن به دست مشتریان خود برساند و در صورت نارضایتی مشتریان وجه را برای آن‌ها عودت
          دهد. اما این ویژگی ها، بین تمامی فروشگاه های اینترنتی مشترک است. پس وجه تمایز رز سفید
          چیست؟ مشاوره تخصصی لوازم آرایشی، بهداشتی، محصولات مراقبت از پوست و مشاوره خرید تخصصی ادکلن
          در رز سفید، وجه تمایز ما با سایر فروشگاه ها است.
        </p>

        <h2>خرید لوازم آرایشی</h2>
        <p>
          با توجه به افزایش روز افزون برند های لوازم آرایشی و تنوع محصولات،{' '}
          <a
            style={{ color: '#ff0000' }}
            href="https://rozesefid.com/product-category/cosmetics/"
            target="_blank"
            rel="noopener"
          >
            خرید لوازم آرایشی
          </a>{' '}
          به یک چالش اساسی برای مشتریان تبدیل شده است؛ از این رو به هنگام انتخاب لوازم آرایشی به چند
          عامل مهم مانند؛ اصالت کالا، ضمانت بازگشت وجه و قیمت لوازم آرایشی باید دقت کرد. رز سفید
          علاوه بر حل تمامی این چالش ها برای شما، مشاوره رایگان خرید لوازم آرایشی را برای شما قرار
          داده تا خرید بهتری را تجربه کنید. حال سوال اینجاست که چه نوع لوازم آرایشی در رز سفید موجود
          است؟ از جمله محصولات آرایشی رز سفید می‌توان به؛ کرم پودر، کانسیلر،{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/cosmetics/face-makeup/pancake/"
            target="_blank"
            rel="noopener"
          >
            پنکک
          </a>
          ، فیکساتور، ریمل،{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/cosmetics/eye-cosmetics/eye-linear-eye-cosmetics/"
            target="_blank"
            rel="noopener"
          >
            خط چشم
          </a>
          ، سایه چشم، لنز چشم، رژ لب و لاک ناخن اشاره کرد. این محصولات را می‌توانید از بهترین برند
          های خارجی مانند؛ پوپا، گلدن رز، کاپرا، میکاپ فکتوری، آموتیا، بل، نارس و … به همراه ضمانت
          اورجینال بودن کالا از رز سفید تهیه کنید.
        </p>

        <h2>خرید ادکلن و عطر</h2>
        <p>
          یکی از چالش های اصلی خریداران ادکلن، بحث اورجینال بودن کالا است. با توجه به افزایش قیمت
          عطر، نمی‌توان به هر فروشگاه اینترنتی عطر و ادکلن اعتماد کرد و خرید انجام داد، از این رو
          باید به فروشگاه های اینترنتی معتبر مانند رز سفید مراجع کرد تا علاوه بر ضمانت اصالت کالا،
          ضمانت بازگشت وجه نیز ارائه شود تا{' '}
          <a
            href="https://rozesefid.com/product-category/perfume-cologne/"
            target="_blank"
            rel="noopener"
          >
            خرید عطر
          </a>{' '}
          با اطمینان بیشتری انجام شود. در فروشگاه اینترنتی رز سفید، می‌توانید انواع عطر و ادکلن
          مانند: عطر مردانه و عطر زنانه را با بهترین قیمت و ضمانت اصل بودن کالا تهیه کنید.
        </p>

        <h2>خرید محصولات پوستی</h2>
        <p>
          امروزه با توجه به آلوده تر شدن هوا، چالش های زندگی و تعذیه نامناسب، مشکلات پوستی بسیار
          فراگیر شده است. از این رو داشتن روتین پوستی مناسب و استفاده از محصولات پوستی اورجینال و با
          کیفیت به شما پیشنهاد می‌شود. از جمله محصولات مورد نیاز برای داشت یک روتین پوستی می‌توان به{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/skin-care/facial-skin-care/sunscreen/"
            target="_blank"
            rel="noopener"
          >
            کرم ضد آفتاب
          </a>
          ، کرم آبرسان، میسلار واتر،{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/skin-care/skin-cleanser/face-toner/"
            target="_blank"
            rel="noopener"
          >
            تونر
          </a>
          ، ماسک صورت و انواع کرم دور چشم اشاره کرد. اما با توجه به تنوع کالا ها چه محصولی مناسب شما
          است؟ جواب این سوال را می‌توانید از کارشناسان پوست رز سفید دریافت کنید. به علاوه می‌توانید
          با نظر کارشناسان ما روتین پوستی مناسب خود را داشته باشید و داشتن پوستی شاداب برای همیشه را
          تجربه کنید.
        </p>

        <h2>محصولات مو در رز سفید</h2>
        <p>
          محصولاتی مانند؛{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/hair-products/hair-color-accessories/hair-dye-and-hair-dye-kit/"
            target="_blank"
            rel="noopener"
          >
            رنگ مو
          </a>
          ، دکلره، اکسیدان، ماسک مو، روغن مو، شامپو رنگساژ یا شامپو رنگ مو، لوسیون مو، مواد کراتینه
          و مواد فر مو از جمله محصولات این دسته در فروشگاه رز سفید هستند. این محصولات از برند های
          مطرح ایرانی و خارجی را می‌توانید از رز سفید با تخفیف ویژه تهیه کنید.
        </p>

        <h2>خرید لوازم شخصی برقی</h2>
        <p>
          شاید برای شما سوال باشد که این دسته از محصولات، شامل چه چیزهایی هستند؟ در این دسته شما
          می‌توانید انواع محصولات برقی که مربوط به بهداشت شخصی هستند را مشاهده کنید. از جمله این
          محصولات می‌توان به{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/electrical-appliances/scalp-shaving/"
            target="_blank"
            rel="noopener"
          >
            ماشین اصلاح سر
          </a>
          ، ماشین اصلاح صورت، بابلیس، اتو مو، مسواک برقی و سشوار اشاره کرد. این دسته از محصولات را
          می‌توانید از برند های مطرح خارجی مانند؛ فیلیپس، بابیلیس، براون، موزر مک استایلر، رمینگتون
          و … در فروشگاه اینترنتی رز سفید مشاهده و مقایسه کنید.
        </p>

        <h2>خرید لوازم بهداشتی</h2>
        <p>
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/cosmetic/"
            target="_blank"
            rel="noopener"
          >
            لوازم بهداشتی
          </a>{' '}
          یکی از پر فروش ترین دسته محصولات در فروشگاه رز سفید است. محصولات این دسته عبارتند از؛
          محصولات بهداشت دهان و دندان و محصولات بهداشت بدن شامل؛ شوینده بدن،{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/cosmetic/health-care/antiperspirant-and-deodorant/"
            target="_blank"
            rel="noopener"
          >
            ضد تعریق
          </a>{' '}
          و لوازم اصلاح بدن. انتخاب نامناسب این محصولات می‌تواند آسیب هایی مانند خشکی پوست را برای
          شما به همراه داشته باشد. پس در انتخاب لوازم بهداشتی خود دقت کافی را داشته باشید و در صورت
          نیاز با کارشناسان رز سفید در ارتباط باشید.
        </p>

        <h2>مو مصنوعی</h2>
        <p>
          اگر مهمانی خاصی در پیش دارید، کلاس آموزشی بافت مو، اصلاح سر و رنگ سر دارید و یا کار آموز
          شغل آرایشگری هستید، این بخش از محصولات رز سفید مخصوص شما است. از جمله محصولات{' '}
          <a
            style={{ color: '#e1187f' }}
            href="https://rozesefid.com/product-category/artificial-hair/"
            target="_blank"
            rel="noopener"
          >
            مو مصنوعی
          </a>{' '}
          می‌‌توان به انواع پوستیژ، مو دم اسبی، مو کلیپسی و مو متری اشاره کرد.
        </p>
      </div>
      <span className="container_page flex justify-end border-b border-[#E4E7E9]">
        <Button onClick={() => setOpen(!open)} className="w-fit min-w-fit text-main">
          <Arrow_back_mobile className="h-4 w-4 rotate-90 stroke-main" />
          <span>{open ? 'مشاهده کمتر' : 'مشاهده بیشتر'}</span>
        </Button>
      </span>
    </div>
  );
}
